Public Attributes | List of all members
API_SavePars_Object Struct Reference
Project Operations
Contains the different options for saving an Archicad object, lamp, door, or window. More...
#include <APIdefs_Automate.h>
 Public Attributes
 API_ConvModID  | libItMode
: The place to put the GDL text/binary information (only when saving from the 3D view). Can be either API_ConvMod_SymTxtGDL or API_ConvMod_SymBinGDL.
 bool  | removeLine
Remove redundant lines (only when saving from the 3D view).
 bool  | saveSelOnly
Save selection only when the file type is object file (only when saving from a 2D view).
 bool  | view2D
Save 2D or 3D view (when the file type is object file).
 bool  | isPlaceable
The saved library part is placeable.
Detailed Description
Contains the different options for saving an Archicad object, lamp, door, or window.
Remarks
If you want to save the plan view of an element or the selected elements (this is controlled by the saveSelOnly field), then set view2D to true. In this case, the type of the file (fileTypeID in API_FileSavePars should be set to APIFType_ObjectFile. When you want to save the 3D view, then clear the view2D field. In this case the fileTypeID can be @ref APIFType_ObjectFile, APIFType_DoorFile, or APIFType_WindowFile. The libItMode field controls whether the file should become an editable text or a non-editable binary file. The removeLine field effects only objects saved from the 3D view.